imchangchang/incubator-nuttx/arch/arm/src/gd32f4xx/gd32_can.c
/****************************************************************************
 * arch/arm/src/gd32f4xx/gd32_can.c
 *
 *   Copyright (C) 2011, 2016-2017 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.org>
 *
 *   Copyright (C) 2016 Omni Hoverboards Inc. All rights reserved.
 *   Author: Paul Alexander Patience <paul-a.patience@polymtl.ca>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <inttypes.h>
#include <stdio.h>
#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <errno.h>
#include <debug.h>

#include <arch/board/board.h>
#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/can/can.h>

#include "arm_internal.h"
#include "arm_arch.h"

#include "chip.h"
#include "gd32f4xx.h"
#ifdef CONFIG_GD32_CAN

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Delays *******************************************************************/

/* Time out for INAK bit */

#define INAK_TIMEOUT 65535

/* Bit timing ***************************************************************/

#define CAN_BIT_QUANTA (CONFIG_GD32_CAN_TSEG1 + CONFIG_GD32_CAN_TSEG2 + 1)

#ifndef CONFIG_DEBUG_CAN_INFO
#  undef CONFIG_GD32_CAN_REGDEBUG
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct gd32_can_s {
	uint8_t port; /* CAN port num */
	uint32_t can_periph; /* CAN periph */
	uint8_t canrx[2]; /* CAN RX FIFO 0/1 IRQ number */
	uint8_t cantx; /* CAN TX IRQ number */
	uint8_t filter; /* Filter number */
	uint32_t baud; /* Configured baud */

  uint32_t gpio_rx_periph;
  uint32_t gpio_rx_af;
  uint32_t gpio_rx_pin;

  uint32_t gpio_tx_periph;
  uint32_t gpio_tx_af;
  uint32_t gpio_tx_pin;
  uint8_t sjw;
  uint8_t bs1;
  uint8_t bs2;
  uint16_t psc;
  uint32_t sample_point; /* 0.1%, 1000 for 100%*/
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* CAN Register access */

#ifdef CONFIG_CAN_EXTID
static int  gd32can_addextfilter(FAR struct gd32_can_s *priv,
                                  FAR struct canioc_extfilter_s *arg);
static int  gd32can_delextfilter(FAR struct gd32_can_s *priv,
                                  int arg);
#endif
static int gd32can_addstdfilter(FAR struct gd32_can_s *priv,
		FAR struct canioc_stdfilter_s *arg);
static int gd32can_delstdfilter(FAR struct gd32_can_s *priv, int arg);

/* CAN driver methods */

static void gd32can_reset(FAR struct can_dev_s *dev);
static int gd32can_setup(FAR struct can_dev_s *dev);
static void gd32can_shutdown(FAR struct can_dev_s *dev);
static void gd32can_rxint(FAR struct can_dev_s *dev, bool enable);
static void gd32can_txint(FAR struct can_dev_s *dev, bool enable);
static int gd32can_ioctl(FAR struct can_dev_s *dev, int cmd, unsigned long arg);
static int gd32can_remoterequest(FAR struct can_dev_s *dev, uint16_t id);
static int gd32can_send(FAR struct can_dev_s *dev, FAR struct can_msg_s *msg);
static bool gd32can_txready(FAR struct can_dev_s *dev);
static bool gd32can_txempty(FAR struct can_dev_s *dev);

/* CAN interrupt handling */

static int gd32can_rxinterrupt(FAR struct can_dev_s *dev, int rxmb);
static int gd32can_rx0interrupt(int irq, FAR void *context, FAR void *arg);
static int gd32can_rx1interrupt(int irq, FAR void *context, FAR void *arg);
static int gd32can_txinterrupt(int irq, FAR void *context, FAR void *arg);

/* Initialization */

static int gd32can_enterinitmode(FAR struct gd32_can_s *priv);
static int gd32can_exitinitmode(FAR struct gd32_can_s *priv);
static int gd32can_bittiming(FAR struct gd32_can_s *priv);
static int gd32can_cellinit(FAR struct gd32_can_s *priv);
static int gd32can_filterinit(FAR struct gd32_can_s *priv);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct can_ops_s g_canops = { 
    .co_reset = gd32can_reset,
	.co_setup = gd32can_setup,
    .co_shutdown = gd32can_shutdown, 
    .co_rxint = gd32can_rxint, 
    .co_txint = gd32can_txint, 
    .co_ioctl = gd32can_ioctl, 
    .co_remoterequest = gd32can_remoterequest,
	.co_send = gd32can_send,
    .co_txready = gd32can_txready, 
    .co_txempty = gd32can_txempty, 
 };

#ifdef CONFIG_GD32_CAN0
static struct gd32_can_s g_can0priv =
{
  .port             = 0,
  .can_periph       = CAN0,
  .canrx            =
  {
					  GD32_IRQ_NUM(CAN0_RX0_IRQn),
					  GD32_IRQ_NUM(CAN0_RX1_IRQn),
  },
  .cantx            = GD32_IRQ_NUM(CAN0_TX_IRQn),
  .filter           = 0,
  .baud             = CONFIG_GD32_CAN0_BAUD,
  .gpio_rx_periph   = GPIO_CAN0_RX_PORT,
  .gpio_rx_af       = GPIO_CAN0_RX_AF,
  .gpio_rx_pin      = GPIO_CAN0_RX_PIN,
  .gpio_tx_periph   = GPIO_CAN0_TX_PORT,
  .gpio_tx_af       = GPIO_CAN0_TX_AF,
  .gpio_tx_pin      = GPIO_CAN0_TX_PIN,
};

