imchangchang/incubator-nuttx/arch/arm/src/gd32f4xx/gd32_can.c
static struct can_dev_s g_can0dev =
{
  .cd_ops           = &g_canops,
  .cd_priv          = &g_can0priv,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/
static uint32_t _get_gpio_rcu_periph(uint32_t gpio_periph) {
#define GPIO_RCU(gpio) case gpio: return RCU_##gpio
	switch (gpio_periph) {
	  GPIO_RCU(GPIOA);
		GPIO_RCU(GPIOB);
		GPIO_RCU(GPIOC);
		GPIO_RCU(GPIOD);
		GPIO_RCU(GPIOE);
		GPIO_RCU(GPIOF);
		GPIO_RCU(GPIOG);
		GPIO_RCU(GPIOH);
		GPIO_RCU(GPIOI);
		default:
		PANIC();
	}
#undef GPIO_RCU
}

static uint32_t _get_can_rcu_periph(uint32_t can_periph) {
#define CAN_RCU(can) case can: return RCU_##can
	switch (can_periph) {
	CAN_RCU(CAN0);		
  CAN_RCU(CAN1);
		default:
		PANIC();
	}
#undef CAN_RCU
}

static uint32_t _can_gpio_rcu_init(FAR struct gd32_can_s *priv){

  rcu_periph_clock_enable(_get_can_rcu_periph(priv->can_periph));
  rcu_periph_clock_enable(_get_gpio_rcu_periph(priv->gpio_rx_periph));
  rcu_periph_clock_enable(_get_gpio_rcu_periph(priv->gpio_tx_periph));

  gpio_output_options_set(priv->gpio_rx_periph, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, priv->gpio_rx_pin);
  gpio_mode_set(priv->gpio_rx_periph, GPIO_MODE_AF, GPIO_PUPD_NONE, priv->gpio_rx_pin);
  gpio_af_set(priv->gpio_rx_periph, priv->gpio_rx_af, priv->gpio_rx_pin);
  
  gpio_output_options_set(priv->gpio_tx_periph, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, priv->gpio_tx_pin);
  gpio_mode_set(priv->gpio_tx_periph, GPIO_MODE_AF, GPIO_PUPD_NONE, priv->gpio_tx_pin);
  gpio_af_set(priv->gpio_tx_periph, priv->gpio_tx_af, priv->gpio_tx_pin);

  return OK;
}

/****************************************************************************
 * Name: gd32can_reset
 *
 * Description:
 *   Reset the CAN device.  Called early to initialize the hardware. This
 *   function is called, before gd32can_setup() and on error conditions.
 *
 * Input Parameters:
 *   dev - An instance of the "upper half" can driver state structure.
 *
 * Returned Value:
 *  None
 *
 ****************************************************************************/

static void gd32can_reset(FAR struct can_dev_s *dev) {
	FAR struct gd32_can_s *priv = dev->cd_priv;
	irqstate_t flags;

	caninfo ("CAN%d\n", priv->port);

	/* Disable interrupts momentarily to stop any ongoing CAN event processing
	 * and to prevent any concurrent access to the AHB1RSTR register.
	 */

	flags = enter_critical_section();

  caninfo("Before reset:0x%08x\n", CAN_CTL(priv->can_periph));
  CAN_CTL(priv->can_periph) |= CAN_CTL_SWRST;
  caninfo("After reset:0x%08x\n", CAN_CTL(priv->can_periph));

	/* Reset the CAN */
	leave_critical_section(flags);
}

/****************************************************************************
 * Name: gd32can_setup
 *
 * Description:
 *   Configure the CAN. This method is called the first time that the CAN
 *   device is opened.  This will occur when the port is first opened.
 *   This setup includes configuring and attaching CAN interrupts.
 *   All CAN interrupts are disabled upon return.
 *
 * Input Parameters:
 *   dev - An instance of the "upper half" can driver state structure.
 *
 * Returned Value:
 *   Zero on success; a negated errno on failure
 *
 ****************************************************************************/

static int gd32can_setup(FAR struct can_dev_s *dev) {
	FAR struct gd32_can_s *priv = dev->cd_priv;
	int ret;

	caninfo ("CAN%d RX0 irq: %d RX1 irq: %d TX irq: %d\n", priv->port, priv->canrx[0], priv->canrx[1], priv->cantx);

	/* CAN cell initialization */
  _can_gpio_rcu_init(priv);
	ret = gd32can_cellinit(priv);
	if (ret < 0) {
		canerr ("ERROR: CAN%d cell initialization failed: %d\n", priv->port, ret);
		return ret;
	}

	/* CAN filter initialization */
	ret = gd32can_filterinit(priv);
	if (ret < 0) {
		canerr ("ERROR: CAN%d filter initialization failed: %d\n", priv->port, ret);
		return ret;
	}

	/* Attach the CAN RX FIFO 0/1 interrupts and TX interrupts.
	 * The others are not used.
	 */
	ret = irq_attach(priv->canrx[0], gd32can_rx0interrupt, dev);
	if (ret < 0) {
		canerr ("ERROR: Failed to attach CAN%d RX0 IRQ (%d)", priv->port, priv->canrx[0]);
		return ret;
	}

	ret = irq_attach(priv->canrx[1], gd32can_rx1interrupt, dev);
	if (ret < 0) {
		canerr ("ERROR: Failed to attach CAN%d RX1 IRQ (%d)", priv->port, priv->canrx[1]);
		return ret;
	}

	ret = irq_attach(priv->cantx, gd32can_txinterrupt, dev);
	if (ret < 0) {
		canerr ("ERROR: Failed to attach CAN%d TX IRQ (%d)", priv->port, priv->cantx);
		return ret;
	}

	/* Enable the interrupts at the NVIC.  Interrupts are still disabled in
	 * the CAN module.  Since we coming out of reset here, there should be
	 * no pending interrupts.
	 */

	up_enable_irq(priv->canrx[0]);
	up_enable_irq(priv->canrx[1]);
	up_enable_irq(priv->cantx);

	return OK;
}

/****************************************************************************
 * Name: gd32can_shutdown
 *
 * Description:
 *   Disable the CAN.  This method is called when the CAN device is closed.
 *   This method reverses the operation the setup method.
 *
 * Input Parameters:
 *   dev - An instance of the "upper half" can driver state structure.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void gd32can_shutdown(FAR struct can_dev_s *dev) {
	FAR struct gd32_can_s *priv = dev->cd_priv;

	caninfo ("CAN%d\n", priv->port);

	/* Disable the RX FIFO 0/1 and TX interrupts */

	up_disable_irq(priv->canrx[0]);
	up_disable_irq(priv->canrx[1]);
	up_disable_irq(priv->cantx);

	/* Detach the RX FIFO 0/1 and TX interrupts */

	irq_detach(priv->canrx[0]);
	irq_detach(priv->canrx[1]);
	irq_detach(priv->cantx);

	/* And reset the hardware */

	gd32can_reset(dev);
}

/****************************************************************************
 * Name: gd32can_rxint
 *
 * Description:
 *   Call to enable or disable RX interrupts.
 *
 * Input Parameters:
 *   dev - An instance of the "upper half" can driver state structure.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

