imchangchang/incubator-nuttx/arch/arm/src/gd32f4xx/gd32_can.c
static void gd32can_rxint(FAR struct can_dev_s *dev, bool enable) {
	FAR struct gd32_can_s *priv = dev->cd_priv;

	caninfo ("CAN%d enable: %d\n", priv->port, enable);

	/* Enable/disable the FIFO 0/1 message pending interrupt */
  if (enable)
  {
    can_interrupt_enable(priv->can_periph, CAN_INT_RFNE0);
    can_interrupt_enable(priv->can_periph, CAN_INT_RFNE1);
  }
  else{
    can_interrupt_disable(priv->can_periph, CAN_INT_RFNE0);
    can_interrupt_disable(priv->can_periph, CAN_INT_RFNE1);
  }

}

/****************************************************************************
 * Name: gd32can_txint
 *
 * Description:
 *   Call to enable or disable TX interrupts.
 *
 * Input Parameters:
 *   dev - An instance of the "upper half" can driver state structure.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void gd32can_txint(FAR struct can_dev_s *dev, bool enable) {
	FAR struct gd32_can_s *priv = dev->cd_priv;

	caninfo ("CAN%d enable: %d\n", priv->port, enable);

	/* Support only disabling the transmit mailbox interrupt */
  if (enable)
  {
    can_interrupt_enable(priv->can_periph, CAN_INT_TME);
  }
  else{
    can_interrupt_disable(priv->can_periph, CAN_INT_TME);
  }
}

/****************************************************************************
 * Name: gd32can_ioctl
 *
 * Description:
 *   All ioctl calls will be routed through this method
 *
 * Input Parameters:
 *   dev - An instance of the "upper half" can driver state structure.
 *
 * Returned Value:
 *   Zero on success; a negated errno on failure
 *
 ****************************************************************************/

static int gd32can_ioctl(FAR struct can_dev_s *dev, int cmd, unsigned long arg) {
	FAR struct gd32_can_s *priv;
	int ret = -ENOTTY;

	caninfo ("cmd=%04x arg=%lu\n", cmd, arg);

	DEBUGASSERT(dev && dev->cd_priv);
	priv = dev->cd_priv;

	/* Handle the command */

	switch (cmd) {
	/* CANIOC_GET_BITTIMING:
	 *   Description:    Return the current bit timing settings
	 *   Argument:       A pointer to a write-able instance of struct
	 *                   canioc_bittiming_s in which current bit timing
	 *                   values will be returned.
	 *   Returned Value: Zero (OK) is returned on success.  Otherwise -1
	 *                   (ERROR) is returned with the errno variable set
	 *                   to indicate the nature of the error.
	 *   Dependencies:   None
	 */

	case CANIOC_GET_BITTIMING: {
		FAR struct canioc_bittiming_s *bt = (FAR struct canioc_bittiming_s*) arg;
		DEBUGASSERT(bt != NULL);
		bt->bt_sjw    = priv->sjw;
		bt->bt_tseg1  = priv->bs1;
		bt->bt_tseg2  = priv->bs2;
		bt->bt_baud   = rcu_clock_freq_get(CK_APB1) / (float)(priv->psc * (uint32_t)(priv->sjw + priv->bs1 + priv->bs2));
    caninfo("clk:%d baud:%d\n", rcu_clock_freq_get(CK_APB1), bt->bt_baud);
		ret = OK;
	}
		break;

		/* CANIOC_SET_BITTIMING:
		 *   Description:    Set new current bit timing values
		 *   Argument:       A pointer to a read-able instance of struct
		 *                   canioc_bittiming_s in which the new bit timing
		 *                   values are provided.
		 *   Returned Value: Zero (OK) is returned on success.  Otherwise -1
		 *                   (ERROR)is returned with the errno variable set
		 *                    to indicate thenature of the error.
		 *   Dependencies:   None
		 *
		 * REVISIT: There is probably a limitation here:  If there are
		 * multiple threads trying to send CAN packets, when one of these
		 * threads reconfigures the bitrate, the MCAN hardware will be reset
		 * and the context of operation will be lost.  Hence, this IOCTL can
		 * only safely be executed in quiescent time periods.
		 */

	case CANIOC_SET_BITTIMING: {
		FAR const struct canioc_bittiming_s *bt =
				(FAR const struct canioc_bittiming_s*) arg;

		DEBUGASSERT(bt != NULL);
		DEBUGASSERT(bt->bt_sjw > 0 && bt->bt_sjw <= 4);
		DEBUGASSERT(bt->bt_tseg1 > 0 && bt->bt_tseg1 <= 16);
		DEBUGASSERT(bt->bt_tseg2 > 0 && bt->bt_tseg2 <= 8);

    ret = -ENOSYS;
  }
		break;

		/* CANIOC_GET_CONNMODES:
		 *   Description:    Get the current bus connection modes
		 *   Argument:       A pointer to a write-able instance of struct
		 *                   canioc_connmodes_s in which the new bus modes will
		 *                   be returned.
		 *   Returned Value: Zero (OK) is returned on success.  Otherwise -1
		 *                   (ERROR)is returned with the errno variable set
		 *                   to indicate the nature of the error.
		 *   Dependencies:   None
		 */

	case CANIOC_GET_CONNMODES: {
		FAR struct canioc_connmodes_s *bm = (FAR struct canioc_connmodes_s*) arg;
    ret = -ENOSYS;
	}
		break;

		/* CANIOC_SET_CONNMODES:
		 *   Description:    Set new bus connection modes values
		 *   Argument:       A pointer to a read-able instance of struct
		 *                   canioc_connmodes_s in which the new bus modes
		 *                   are provided.
		 *   Returned Value: Zero (OK) is returned on success.  Otherwise -1
		 *                   (ERROR) is returned with the errno variable set
		 *                   to indicate the nature of the error.
		 *   Dependencies:   None
		 */

	case CANIOC_SET_CONNMODES: {
		FAR struct canioc_connmodes_s *bm = (FAR struct canioc_connmodes_s*) arg;
    ret = -ENOSYS;
  }
		break;

#ifdef CONFIG_CAN_EXTID
      /* CANIOC_ADD_EXTFILTER:
       *   Description:    Add an address filter for a extended 29 bit
       *                   address.
       *   Argument:       A reference to struct canioc_extfilter_s
       *   Returned Value: A non-negative filter ID is returned on success.
       *                   Otherwise -1 (ERROR) is returned with the errno
       *                   variable set to indicate the nature of the error.
       */

      case CANIOC_ADD_EXTFILTER:
        {
          DEBUGASSERT(arg != 0);
          ret = gd32can_addextfilter(priv,
                                      (FAR struct canioc_extfilter_s *)arg);
        }
        break;

      /* CANIOC_DEL_EXTFILTER:
       *   Description:    Remove an address filter for a standard 29 bit
       *                   address.
       *   Argument:       The filter index previously returned by the
       *                   CANIOC_ADD_EXTFILTER command
       *   Returned Value: Zero (OK) is returned on success.  Otherwise -1
       *                   (ERROR)is returned with the errno variable set
       *                   to indicate the nature of the error.
       */

