imchangchang/incubator-nuttx/arch/arm/src/gd32f4xx/gd32_can.c
      case CANIOC_DEL_EXTFILTER:
        {
#if 0 /* Unimplemented */
          DEBUGASSERT(arg <= priv->config->nextfilters);
#endif
          ret = gd32can_delextfilter(priv, (int)arg);
        }
        break;
#endif

		/* CANIOC_ADD_STDFILTER:
		 *   Description:    Add an address filter for a standard 11 bit
		 *                   address.
		 *   Argument:       A reference to struct canioc_stdfilter_s
		 *   Returned Value: A non-negative filter ID is returned on success.
		 *                   Otherwise -1 (ERROR) is returned with the errno
		 *                   variable set to indicate the nature of the error.
		 */

	case CANIOC_ADD_STDFILTER: {
		DEBUGASSERT(arg != 0);
		ret = gd32can_addstdfilter(priv, (FAR struct canioc_stdfilter_s*) arg);
	}
		break;

		/* CANIOC_DEL_STDFILTER:
		 *   Description:    Remove an address filter for a standard 11 bit
		 *                   address.
		 *   Argument:       The filter index previously returned by the
		 *                   CANIOC_ADD_STDFILTER command
		 *   Returned Value: Zero (OK) is returned on success.  Otherwise -1
		 *                   (ERROR) is returned with the errno variable set
		 *                   to indicate the nature of the error.
		 */

	case CANIOC_DEL_STDFILTER: {
		ret = gd32can_delstdfilter(priv, (int) arg);
	}
		break;

		/* Unsupported/unrecognized command */
	case CANIOC_SET_NART: 
	case CANIOC_SET_ABOM: 
    ret = -ENOSYS;
	default:
		canerr ("ERROR: Unrecognized command: %04x\n", cmd);
	}

	return ret;
}

/****************************************************************************
 * Name: gd32can_remoterequest
 *
 * Description:
 *   Send a remote request
 *
 * Input Parameters:
 *   dev - An instance of the "upper half" can driver state structure.
 *
 * Returned Value:
 *   Zero on success; a negated errno on failure
 *
 ****************************************************************************/

static int gd32can_remoterequest(FAR struct can_dev_s *dev, uint16_t id) {
#warning "Remote request not implemented"
	return -ENOSYS;
}

static bool gd32can_txmb0empty(FAR struct gd32_can_s * priv){
  return CAN_TSTAT_TME0 == (CAN_TSTAT(priv->can_periph) & CAN_TSTAT_TME0);
}
static bool gd32can_txmb1empty(FAR struct gd32_can_s * priv){
  return CAN_TSTAT_TME1 == (CAN_TSTAT(priv->can_periph) & CAN_TSTAT_TME1);
}
static bool gd32can_txmb2empty(FAR struct gd32_can_s * priv){
  return CAN_TSTAT_TME2 == (CAN_TSTAT(priv->can_periph) & CAN_TSTAT_TME2);
}

/****************************************************************************
 * Name: gd32can_send
 *
 * Description:
 *    Send one can message.
 *
 *    One CAN-message consists of a maximum of 10 bytes.  A message is
 *    composed of at least the first 2 bytes (when there are no data bytes).
 *
 *    Byte 0:      Bits 0-7: Bits 3-10 of the 11-bit CAN identifier
 *    Byte 1:      Bits 5-7: Bits 0-2 of the 11-bit CAN identifier
 *                 Bit 4:    Remote Transmission Request (RTR)
 *                 Bits 0-3: Data Length Code (DLC)
 *    Bytes 2-10: CAN data
 *
 * Input Parameters:
 *   dev - An instance of the "upper half" can driver state structure.
 *
 * Returned Value:
 *   Zero on success; a negated errno on failure
 *
 ****************************************************************************/

static int gd32can_send(FAR struct can_dev_s *dev, FAR struct can_msg_s *msg) {
	FAR struct gd32_can_s *priv = dev->cd_priv;
	int txmb;
  can_trasnmit_message_struct send_msg;


  send_msg.tx_sfid = msg->cm_hdr.ch_id;
  send_msg.tx_ft = CAN_FT_DATA;
  send_msg.tx_ff = CAN_FF_STANDARD;
  send_msg.tx_dlen = msg->cm_hdr.ch_dlc;
  memcpy(send_msg.tx_data, msg->cm_data, send_msg.tx_dlen);

  txmb = can_message_transmit(priv->can_periph, &send_msg);

  if (txmb == CAN_NOMAILBOX)
	return -EBUSY;

	caninfo ("CAN%d ID: %" PRId32 " DLC: %d send mb:%d\n", 
           priv->port, (uint32_t) msg->cm_hdr.ch_id, msg->cm_hdr.ch_dlc, txmb);

	return OK;
}

/****************************************************************************
 * Name: gd32can_txready
 *
 * Description:
 *   Return true if the CAN hardware can accept another TX message.
 *
 * Input Parameters:
 *   dev - An instance of the "upper half" can driver state structure.
 *
 * Returned Value:
 *   True if the CAN hardware is ready to accept another TX message.
 *
 ****************************************************************************/

static bool gd32can_txready(FAR struct can_dev_s *dev) {
	FAR struct gd32_can_s *priv = dev->cd_priv;
	uint32_t regval;

	/* Return true if any mailbox is available */
	return gd32can_txmb0empty(priv) || gd32can_txmb1empty(priv)
			|| gd32can_txmb2empty(priv);
}

/****************************************************************************
 * Name: gd32can_txempty
 *
 * Description:
 *   Return true if all message have been sent.  If for example, the CAN
 *   hardware implements FIFOs, then this would mean the transmit FIFO is
 *   empty.  This method is called when the driver needs to make sure that
 *   all characters are "drained" from the TX hardware before calling
 *   co_shutdown().
 *
 * Input Parameters:
 *   dev - An instance of the "upper half" can driver state structure.
 *
 * Returned Value:
 *   True if there are no pending TX transfers in the CAN hardware.
 *
 ****************************************************************************/

static bool gd32can_txempty(FAR struct can_dev_s *dev) {
	FAR struct gd32_can_s *priv = dev->cd_priv;
	return gd32can_txmb0empty(priv) && gd32can_txmb1empty(priv)
			&& gd32can_txmb2empty(priv);
}

/****************************************************************************
 * Name: gd32can_rxinterrupt
 *
 * Description:
 *   CAN RX FIFO 0/1 interrupt handler
 *
 * Input Parameters:
 *   irq - The IRQ number of the interrupt.
 *   context - The register state save array at the time of the interrupt.
 *   rxmb - The RX mailbox number.
 *
 * Returned Value:
 *   Zero on success; a negated errno on failure
 *
 ****************************************************************************/

static int gd32can_rxinterrupt(FAR struct can_dev_s *dev, int fifo_num) {
	FAR struct gd32_can_s *priv;
	struct can_hdr_s hdr = {0};
	uint8_t data[CAN_MAXDATALEN];
  can_receive_message_struct recv_msg;
	int ret;

	DEBUGASSERT(dev != NULL && dev->cd_priv != NULL);
	priv = dev->cd_priv;

