imchangchang/incubator-nuttx/arch/arm/src/gd32f4xx/gd32_can.c
  if (can_interrupt_flag_get(priv->can_periph, CAN_INT_FLAG_RFL0) == SET)
  {
    can_message_receive(priv->can_periph, fifo_num, &recv_msg);
    hdr.ch_id = recv_msg.rx_sfid;
    hdr.ch_unused = 0;
    hdr.ch_dlc = recv_msg.rx_dlen;
    memcpy(data, recv_msg.rx_data, 8);
    ret = can_receive(dev, &hdr, data);
    can_interrupt_flag_clear(priv->can_periph, CAN_INT_FLAG_RFL0);
  }
  else if (can_interrupt_flag_get(priv->can_periph, CAN_INT_FLAG_RFL1) == SET)
  {
    can_message_receive(priv->can_periph, fifo_num, &recv_msg);
    hdr.ch_id = recv_msg.rx_sfid;
    hdr.ch_unused = 0;
    hdr.ch_dlc = recv_msg.rx_dlen;
    memcpy(data, recv_msg.rx_data, 8);
    ret = can_receive(dev, &hdr, data);
    can_interrupt_flag_clear(priv->can_periph, CAN_INT_FLAG_RFL1);
  }
	return ret;
}

/****************************************************************************
 * Name: gd32can_rx0interrupt
 *
 * Description:
 *   CAN RX FIFO 0 interrupt handler
 *
 * Input Parameters:
 *   irq - The IRQ number of the interrupt.
 *   context - The register state save array at the time of the interrupt.
 *
 * Returned Value:
 *   Zero on success; a negated errno on failure
 *
 ****************************************************************************/

static int gd32can_rx0interrupt(int irq, FAR void *context, FAR void *arg) {
	FAR struct can_dev_s *dev = (FAR struct can_dev_s*) arg;
	return gd32can_rxinterrupt(dev, CAN_FIFO0);
}

/****************************************************************************
 * Name: gd32can_rx1interrupt
 *
 * Description:
 *   CAN RX FIFO 1 interrupt handler
 *
 * Input Parameters:
 *   irq - The IRQ number of the interrupt.
 *   context - The register state save array at the time of the interrupt.
 *
 * Returned Value:
 *   Zero on success; a negated errno on failure
 *
 ****************************************************************************/

static int gd32can_rx1interrupt(int irq, FAR void *context, FAR void *arg) {
	FAR struct can_dev_s *dev = (FAR struct can_dev_s*) arg;
	return gd32can_rxinterrupt(dev, CAN_FIFO1);
}

/****************************************************************************
 * Name: gd32can_txinterrupt
 *
 * Description:
 *   CAN TX mailbox complete interrupt handler
 *
 * Input Parameters:
 *   irq - The IRQ number of the interrupt.
 *   context - The register state save array at the time of the interrupt.
 *
 * Returned Value:
 *   Zero on success; a negated errno on failure
 *
 ****************************************************************************/

static int gd32can_txinterrupt(int irq, FAR void *context, FAR void *arg) {
	FAR struct can_dev_s *dev = (FAR struct can_dev_s*) arg;
	FAR struct gd32_can_s *priv;
	uint32_t regval;

	DEBUGASSERT(dev != NULL && dev->cd_priv != NULL);
	priv = dev->cd_priv;

  if (can_interrupt_flag_get(priv->can_periph, CAN_INT_FLAG_MTF0) == SET)
  {
		can_txdone(dev);
    can_interrupt_flag_clear(priv->can_periph, CAN_INT_FLAG_MTF0);
	}
  else if (can_interrupt_flag_get(priv->can_periph, CAN_INT_FLAG_MTF1) == SET)
  {
		can_txdone(dev);
    can_interrupt_flag_clear(priv->can_periph, CAN_INT_FLAG_MTF1);
	}
  else if (can_interrupt_flag_get(priv->can_periph, CAN_INT_FLAG_MTF2) == SET)
  {
		can_txdone(dev);
    can_interrupt_flag_clear(priv->can_periph, CAN_INT_FLAG_MTF2);
	}

	return OK;
}

/****************************************************************************
 * Name: gd32can_cellinit
 *
 * Description:
 *   CAN cell initialization
 *
 * Input Parameters:
 *   priv - A pointer to the private data structure for this CAN block
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure.
 *
 ****************************************************************************/

static int gd32can_cellinit(FAR struct gd32_can_s *priv) {
	int ret;

	caninfo ("CAN%d baud:%d\n", priv->port, priv->baud);

  /* Calculate CAN bit timing*/
  uint32_t can_clk = rcu_clock_freq_get(CK_APB1);
  uint32_t can_baud = priv->baud;
  bool timing_found = false;

  priv->sjw = 1;
  for (priv->psc = 1; priv->psc < 1024 && !timing_found; priv->psc++)
  {
    for (priv->bs1 = 1; priv->bs1 < 16 && !timing_found; priv->bs1++)
    {
      for (priv->bs2 = 1; priv->bs2 < 8 && !timing_found; priv->bs2++)
      {
        uint32_t bit_time_unit = priv->sjw + priv->bs1 + priv->bs2;
        uint32_t calc_baud = can_clk/(priv->psc * bit_time_unit);
        if (can_baud == calc_baud)
        {
          priv->sample_point = ((priv->sjw + priv->bs1) * 1000) / bit_time_unit;
          if (priv->sample_point >= (CONFIG_GD32_CAN_SAMPLE_POINT - 50) &&
              priv->sample_point <= (CONFIG_GD32_CAN_SAMPLE_POINT + 50))
          {
            timing_found = true;
          }
        }
      }
    }
  }

  if (!timing_found)
  {
    canerr("ERROR: failed to calc bit timing!\n");
    return -EINVAL;
  }

  can_parameter_struct can_parameter;

  can_struct_para_init(CAN_INIT_STRUCT, &can_parameter);
  can_deinit(priv->can_periph);

  caninfo("calc bit time,clk:%d, psc:%d, sjw:%d, bs1:%d, bs2:%d, sample_point:%d\n", 
          can_clk, priv->psc, priv->sjw, priv->bs1,priv->bs2,priv->sample_point);

  /* initialize CAN */
  can_parameter.time_triggered = DISABLE;
  can_parameter.auto_bus_off_recovery = DISABLE;
  can_parameter.auto_wake_up = DISABLE;
  can_parameter.no_auto_retrans = DISABLE;
  can_parameter.rec_fifo_overwrite = DISABLE;
  can_parameter.trans_fifo_order = DISABLE;
  can_parameter.working_mode = CAN_NORMAL_MODE;

  can_parameter.resync_jump_width = priv->sjw-1;
  can_parameter.time_segment_1 = priv->bs1-1;
  can_parameter.time_segment_2 = priv->bs2-1;
  can_parameter.prescaler = priv->psc;

  can_init(priv->can_periph, &can_parameter);

  return OK;
}

/****************************************************************************
 * Name: gd32can_filterinit
 *
 * Description:
 *   CAN filter initialization.  CAN filters are not currently used by this
 *   driver.  The CAN filters can be configured in a different way:
 *
 *   1. As a match of specific IDs in a list (IdList mode), or as
 *   2. And ID and a mask (IdMask mode).
 *
 *   Filters can also be configured as:
 *
 *   3. 16- or 32-bit.  The advantage of 16-bit filters is that you get
 *      more filters;  The advantage of 32-bit filters is that you get
 *      finer control of the filtering.
 *
 *   One filter is set up for each CAN.  The filter resources are shared
 *   between the two CAN modules:  CAN1 uses only filter 0 (but reserves
 *   0 through CAN_NFILTERS/2-1); CAN2 uses only filter CAN_NFILTERS/2
 *   (but reserves CAN_NFILTERS/2 through CAN_NFILTERS-1).
 *
 *   32-bit IdMask mode is configured.  However, both the ID and the MASK
 *   are set to zero thus suppressing all filtering because anything masked
 *   with zero matches zero.
 *
 * Input Parameters:
 *   priv - A pointer to the private data structure for this CAN block
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure.
 *
 ****************************************************************************/

static int gd32can_filterinit(FAR struct gd32_can_s *priv) {
  can_filter_parameter_struct     can_filter;
	caninfo ("CAN%d filter: %d\n", priv->port, priv->filter);

  can_filter.filter_number = 0;
  can_filter.filter_mode = CAN_FILTERMODE_MASK;
  can_filter.filter_bits = CAN_FILTERBITS_32BIT;
  can_filter.filter_list_high = 0x0000;
  can_filter.filter_list_low = 0x0000;
  can_filter.filter_mask_high = 0x0000;
  can_filter.filter_mask_low = 0x0000;  
  can_filter.filter_fifo_number = CAN_FIFO0;
  can_filter.filter_enable = ENABLE;
  can_filter_init(&can_filter);

	return OK;
}

/****************************************************************************
 * Name: gd32can_addextfilter
 *
 * Description:
 *   Add a filter for extended CAN IDs
 *
 * Input Parameters:
 *   priv - A pointer to the private data structure for this CAN block
 *   arg  - A pointer to a structure describing the filter
 *
 * Returned Value:
 *   A non-negative filter ID is returned on success.
 *   Otherwise -1 (ERROR) is returned with the errno
 *   set to indicate the nature of the error.
 *
 ****************************************************************************/

#ifdef CONFIG_CAN_EXTID
static int gd32can_addextfilter(FAR struct gd32_can_s *priv,
                                 FAR struct canioc_extfilter_s *arg)
{
  return -ENOTTY;
}
#endif

/****************************************************************************
 * Name: gd32can_delextfilter
 *
 * Description:
 *   Remove a filter for extended CAN IDs
 *
 * Input Parameters:
 *   priv - A pointer to the private data structure for this CAN block
 *   arg  - The filter index previously returned by the
 *            CANIOC_ADD_EXTFILTER command
 *
 * Returned Value:
 *   Zero (OK) is returned on success.  Otherwise -1 (ERROR)
 *   returned with the errno variable set to indicate the
 *   of the error.
 *
 ****************************************************************************/

#ifdef CONFIG_CAN_EXTID
static int gd32can_delextfilter(FAR struct gd32_can_s *priv, int arg)
{
  return -ENOTTY;
}
#endif

/****************************************************************************
 * Name: gd32can_addstdfilter
 *
 * Description:
 *   Add a filter for standard CAN IDs
 *
 * Input Parameters:
 *   priv - A pointer to the private data structure for this CAN block
 *   arg  - A pointer to a structure describing the filter
 *
 * Returned Value:
 *   A non-negative filter ID is returned on success.
 *   Otherwise -1 (ERROR) is returned with the errno
 *   set to indicate the nature of the error.
 *
 ****************************************************************************/

