imchangchang/incubator-nuttx/arch/arm/src/gd32f4xx/gd32_can.c
static int gd32can_addstdfilter(FAR struct gd32_can_s *priv,
		FAR struct canioc_stdfilter_s *arg) {
	return -ENOTTY;
}

/****************************************************************************
 * Name: gd32can_delstdfilter
 *
 * Description:
 *   Remove a filter for standard CAN IDs
 *
 * Input Parameters:
 *   priv - A pointer to the private data structure for this CAN block
 *   arg  - The filter index previously returned by the
 *            CANIOC_ADD_STDFILTER command
 *
 * Returned Value:
 *   Zero (OK) is returned on success.  Otherwise -1 (ERROR)
 *   returned with the errno variable set to indicate the
 *   of the error.
 *
 ****************************************************************************/

static int gd32can_delstdfilter(FAR struct gd32_can_s *priv, int arg) {
	return -ENOTTY;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: gd32_caninitialize
 *
 * Description:
 *   Initialize the selected CAN port
 *
 * Input Parameters:
 *   Port number (for hardware that has multiple CAN interfaces)
 *
 * Returned Value:
 *   Valid CAN device structure reference on success; a NULL on failure
 *
 ****************************************************************************/

FAR struct can_dev_s* gd32_caninitialize(int port) {
	FAR struct can_dev_s *dev = NULL;
	caninfo ("CAN%d\n", port);
	switch (port) {
#ifdef CONFIG_GD32_CAN0
    case 0:
      return &g_can0dev;
#endif
#ifdef CONFIG_GD32_CAN1
    case 1:
      return &g_can1dev;
#endif
	default:
		canerr ("ERROR: Unsupported port %d\n", port);
		return NULL;
	}
}

#endif /* CONFIG_GD32_CAN */ 
